# Ultralytics YOLOv8l (large) model yapı dosyası 
# Bu yapı dosyası, YOLOv8l modelini tanımlar ve eğitim için gerekli katmanları içerir.
# Kaynak: Ultralytics

# Parameters
nc: 80  # Number of classes, veri setine göre değiştir (örneğin 1 ise sadece insan)

scales:  # Model ölçeklendirme katsayıları
  l: [1.00, 1.00, 512]  # YOLOv8l: 209 katman, 43.6M parametre, 165.7 GFLOPS

# YOLOv8 backbone
backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [64, 3, 2]]       # 0 - P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1 - P2/4
  - [-1, 3, C2f, [128, True]]       # 2
  - [-1, 1, Conv, [256, 3, 2]]      # 3 - P3/8
  - [-1, 6, C2f, [256, True]]       # 4
  - [-1, 1, Conv, [512, 3, 2]]      # 5 - P4/16
  - [-1, 6, C2f, [512, True]]       # 6
  - [-1, 1, Conv, [1024, 3, 2]]     # 7 - P5/32
  - [-1, 3, C2f, [1024, True]]      # 8
  - [-1, 1, SPPF, [1024, 5]]        # 9

# YOLOv8 head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 10
  - [[-1, 6], 1, Concat, [1]]                       # 11
  - [-1, 3, C2f, [512]]                             # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 13
  - [[-1, 4], 1, Concat, [1]]                       # 14
  - [-1, 3, C2f, [256]]                             # 15

  - [-1, 1, Conv, [256, 3, 2]]                      # 16
  - [[-1, 12], 1, Concat, [1]]                      # 17
  - [-1, 3, C2f, [512]]                             # 18

  - [-1, 1, Conv, [512, 3, 2]]                      # 19
  - [[-1, 9], 1, Concat, [1]]                       # 20
  - [-1, 3, C2f, [1024]]                            # 21

  - [[15, 18, 21], 1, Detect, [nc]]                # 22 - Detect(P3, P4, P5)
